Revit 2027 API
ContextualHelp Constructor
Constructs a contextual help object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContextualHelp(
	ContextualHelpType helpType,
	string helpPath
)
Public Sub New (
	helpType As ContextualHelpType,
	helpPath As String
)
public:
ContextualHelp(
	ContextualHelpType helpType,
	String^ helpPath
)
new :
        helpType : ContextualHelpType *
        helpPath : string -> ContextualHelp
Parameters
helpType ContextualHelpType
The contextual help type.
helpPath String
The contextual help path.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the helpPath is null or empty.
See Also
Reference
ContextualHelp Class
Autodesk.Revit.UI Namespace